vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN526_DFP.pdsc
    <component Cclass="MCXN526 els_pkc" Cgroup="els_pkc_oscca_sm2" Cversion="1.9.0" condition="component.els_pkc.oscca_sm2.condition_id">
      <description>Component els_pkc.oscca_sm2</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Cipher_Crypt.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_ComputePrehash.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Constants.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_CryptoUtils.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Decrypt.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Ecc.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_EccUtils.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_EncDec_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Encrypt.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_GenerateKeyPair.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Helper.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_InvertPrivateKey.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Keyagreement.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Keyagreement_SelfTest.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_KeyExchange.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_SelfTest.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Signature_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Signature_PreHash.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Signature_SelfTest.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClOsccaSm2/src/mcuxClOsccaSm2_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_ModeConstants.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_SelfTest.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/mcuxClOsccaSm2_Types.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_ConstructTypes.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_CryptoUtils.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_Ecc.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_FP.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_Hash.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_PkcWaLayout.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/mcuxClOsccaSm2_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClOsccaSm2/inc/internal/"/>
      </files>
    </component>
