vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN526_DFP.pdsc
    <component Cclass="MCXN526 els_pkc" Cgroup="els_pkc_prng" Cversion="1.9.0" condition="component.els_pkc.prng.condition_id">
      <description>Component prng</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPrng/src/mcuxClPrng_ELS.c" projectpath="component/els_pkc/src/comps/mcuxClPrng/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_ELS.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPrng/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN526 els_pkc" Cgroup="els_pkc_psa_driver" Cversion="1.9.0" condition="component.els_pkc.psa_driver.condition_id">
      <description>Component els_pkc_psa_driver</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Aead.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Cipher.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_DER_functions.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_export_public_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_generate_ecp_key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Hash.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Key.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Mac.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Rsa.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_UpdateKeyStatus.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_MemoryConsumption.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Oracle.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_primitives.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/els_pkc_crypto_composites.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_ExternalMacroWrappers.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Types.h" projectpath="component/els_pkc/src/comps/mcuxClPsaDriver/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN526 els_pkc" Cgroup="els_pkc_random" Cversion="1.9.0" condition="component.els_pkc.random.condition_id">
      <description>Component els_pkc.random</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_DRBG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_PRNG.c" projectpath="component/els_pkc/src/comps/mcuxClRandom/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/"/>
      </files>
    </component>
